[X2DownloadableContentInfo_WOTC_TRMoreUpgrades]

VestTinySummary = "+背心加成"
UtilityTinySummary = "+通用加成"
GoodColor = "#3ABD23"
BadColor = "#CA7200"
strModule = "Module"
strModules = "Modules"

[TRArmorUpgrade_HighCoverGenerator X2ArmorUpgradeTemplate]
FriendlyName="模块-盾墙"
FriendlyNamePlural="模块-盾墙"
BriefSummary="在你的站立处为队友提供全身掩体。移动或攻击会移除此效果."
TinySummary="+通用加成"
LootTooltip="在你的站立处为队友提供全身掩体。移动或攻击会移除此效果."

[TRArmorUpgrade_WallPhasing X2ArmorUpgradeTemplate]
FriendlyName="模块-幽灵"
FriendlyNamePlural="模块-幽灵"
BriefSummary="允许单位直接穿过障碍物."
TinySummary="+通用加成"
LootTooltip="允许单位直接穿过障碍物."

[TRArmorUpgrade_Grapple X2ArmorUpgradeTemplate]
FriendlyName="模块-爪钩"
FriendlyNamePlural="模块-爪钩"
BriefSummary="发射爪钩并且迅速占领高地."
TinySummary="+通用加成"
LootTooltip="发射爪钩并且迅速占领高地."

[TRArmorUpgrade_TRGrenadePocket X2ArmorUpgradeTemplate]
FriendlyName="模块-重火力"
FriendlyNamePlural="模块-重火力"
BriefSummary="解锁手榴弹插槽.手榴弹专用插槽中的手榴弹获得使用奖励."
TinySummary="+通用加成"
LootTooltip="解锁手榴弹插槽.手榴弹专用插槽中的手榴弹获得使用奖励."

[TRArmorUpgrade_TRAmmoPocket X2ArmorUpgradeTemplate]
FriendlyName="模块-弹夹"
FriendlyNamePlural="模块-弹夹"
BriefSummary="获得专用弹药弹夹插槽."
TinySummary="+通用加成"
LootTooltip="获得专用弹药弹夹插槽."

[TRArmorUpgrade_TRArmorBonus X2ArmorUpgradeTemplate]
FriendlyName="模块-电镀装甲"
FriendlyNamePlural="模块-电镀装甲"
BriefSummary="这个庞大的模块提供了大量的保护，但会降低机动性。获得3点护甲，失去1点移动."
TinySummary="+护甲, -移动"
LootTooltip="这个庞大的模块提供了大量的保护，但会降低机动性。获得3点护甲，失去1点移动."

[TRArmorUpgrade_TRMobilityBonus X2ArmorUpgradeTemplate]
FriendlyName="模块-短跑运动员"
FriendlyNamePlural="模块-短跑运动员"
BriefSummary="用较轻的盔甲代替一些较重的盔甲，舍弃部分防御提高机动性，获得2点移动，失去10点防御."
TinySummary="+移动, -防御"
LootTooltip="用较轻的盔甲代替一些较重的盔甲，舍弃部分防御提高机动性，获得2点移动，失去10点防御."

[TRArmorUpgrade_TRPsiShield X2ArmorUpgradeTemplate]
FriendlyName="模块-灵能屏障"
FriendlyNamePlural="模块-灵能屏障"
BriefSummary="利用天生出众的灵能潜能来产生护盾值，最少2点护盾值."
TinySummary="+护盾值"
LootTooltip="利用天生出众的灵能潜能来产生护盾值，最少2点护盾值."

[TRArmorUpgrade_TRAdrenalineSurge X2ArmorUpgradeTemplate]
FriendlyName="模块-肾上腺素飙升"
FriendlyNamePlural="模块-肾上腺素飙升"
BriefSummary="受到伤害时，获得3点机动性，持续2回合."
TinySummary="+移动"
LootTooltip="受到伤害时，获得3点机动性，持续2回合"

[TRArmorUpgrade_TRSmartMod X2ArmorUpgradeTemplate]
FriendlyName="模块-智能插槽"
FriendlyNamePlural="模块-智能插槽"
BriefSummary="获得额外的护甲升级槽，无互斥规则."
TinySummary="+升级插槽"
LootTooltip="获得额外的护甲升级槽，无互斥规则."

[TRArmorUpgrade_TRShieldRegen X2ArmorUpgradeTemplate]
FriendlyName="模块-屏障发生器"
FriendlyNamePlural="模块-屏障发生器"
BriefSummary="我们士兵生存得到了有效的保障. 提供2点护盾值,每回合再生2点,最多6点.."
TinySummary="+屏障 & 屏障再生"
LootTooltip="我们士兵生存得到了有效的保障. 提供2点护盾值,每回合再生2点,最多6点."

[TRArmorUpgrade_TRPlatedComp X2ArmorUpgradeTemplate]
FriendlyName="模块-镀层背心伴侣"
FriendlyNamePlural="模块-镀层背心伴侣"
BriefSummary="当与镀层背心模块一起使用时，该模块不再提供护甲，而是减少20%受到的伤害."
TinySummary="+减少受到伤害, -护甲"
LootTooltip="当与镀层背心模块一起使用时，该模块不再提供护甲，而是减少20%受到的伤害."

[TRArmorUpgrade_TRHazmatComp X2ArmorUpgradeTemplate]
FriendlyName="模块-生化防护背心伴侣"
FriendlyNamePlural="模块-生化防护背心伴侣"
BriefSummary="与生化防护背心模块一起使用时，爆炸袭击的伤害降低66%."
TinySummary="+减少爆炸伤害"
LootTooltip="与生化防护背心模块一起使用时，爆炸袭击的伤害降低66%."

[TRArmorUpgrade_TRStasisComp X2ArmorUpgradeTemplate]
FriendlyName="模块-静滞背心伴侣"
FriendlyNamePlural="模块-静滞背心伴侣"
BriefSummary="与静滞背心模块一起使用时，每回合额外获得1点生命值（不计入最大治疗量）并恢复10%的意志."
TinySummary="+HP & 恢复意志"
LootTooltip="与静滞背心模块一起使用时，每回合额外获得1点生命值（不计入最大治疗量）并恢复10%的意志."

[X2Ability_MoreUpgradesAbilitySet]
AblativeHP="护盾镀层"